[
    {
        "id": "0",
        "thumb": "public/assets/images/blog/1/blog-thumb.jpg",
        "mainImage": "public/assets/images/blog/1/blog.jpg",
        "mainImageCredit": "",
        "title": "How to easily extract colors from image in Adobe Photoshop",
        "date": "19.10.2019",
        "summary": "Тhere are plenty of websites which can offer to extract colors from images but I believe there is an easier way to do so by just opening Photoshop!",
        "category": "tutorials",
        "content": {
            "p0": "<p>We all have seen an image in pinterest or instagram and wanted to get the exact color palette the creator used for the artwork. Or for instance if it's a picture, you may be inspired by it's atmosphere and wanted to get the most out of it for your next project?</p>",
            "p1": "<p>Well, there are plenty of websites which can offer to extract color palette from images but I believe that there is a easier way to do so by opening Photoshop! So here is the trick:</p>",
            "p2": "<p>I will use an artwork from one of my favourite illustrators out there - <a class='font-weight-bold' href='https://www.lisaglanz.com/' target='_blank'>Lisa Glanz</a>. By opening this image in photoshop, you can go to <b>Filter</b> and select <b>Pixelate - Mosaic</b>.</p> <img data-pin-description='How to easily extract colors from image in Adobe Photoshop' data-pin-url='https://hhristova.com/#/blog/1' src='public/assets/images/blog/1/screen3.jpg' class='img-fluid pb-3 js-button--blog' data-toggle='modal' data-target='#modalPicture' value='Expand photo' role='button' data-img='public/assets/images/blog/1/screen3.jpg' /> <p>Once you select it, the window will appear with option to select a cell size of the mosaic filter.</p> <p>What it basically do is it breaks the image into squares, averaging the color within each square (cells). And the larger the cell size, the larger the mosaic’s squares. In my example below I've used a cell size of 40 because it gives me the best color combination but you can experiment with your own settings depending of the image you are extracting the color palette from.</p> <p>My advice is to use cell size about 40-50 otherwise the colors will be endless or just a few.</p> <img data-pin-description='How to easily extract colors from image in Adobe Photoshop' data-pin-url='https://hhristova.com/#/blog/0' src='public/assets/images/blog/1/screen2.jpg' class='img-fluid pb-3 js-button--blog' data-toggle='modal' data-target='#modalPicture' value='Expand photo' role='button' data-img='public/assets/images/blog/1/screen2.jpg' />",
            "p3": "<p><b>Tip:</b> You can also do this for a specific part of an image!</p><ol><li>Copy the section of the image you want to sample onto a new layer</li><li>Lock the layer’s transparency (the black and white square just above the layers in Layers panel)</li><li>And again apply Mosaic filter</li></ol>",
            "p4": "<p>Once you've applied the mosaic filter it's time to hand-picked the colors we want. Use the Eyedropper tool and select your first color. Then move your mouse over the Swatches palette and you will see that the icon turns from an Eyedropper to a Paint Bucket. With the Paint Bucket, click anywhere on the empty area of the Swatches’ Palette and you will create a new color-swatch square.</p> <p>Once you have selected and dropped your colors in the Swatches Palette, save the palette. Go to the Swatches Palette Options and select 'Save Swatches'.</p><img data-pin-description='How to easily extract colors from image in Adobe Photoshop' data-pin-url='https://hhristova.com/#/blog/0' src='public/assets/images/blog/1/screen1.jpg' class='img-fluid pb-3 js-button--blog' data-toggle='modal' data-target='#modalPicture' value='Expand photo' role='button' data-img='public/assets/images/blog/1/screen1.jpg' /> <p>I hope this trick helps you to create a beautiful color combinations and artworks.</p>"
        }
    },
    {
        "id": "1",
        "thumb": "public/assets/images/blog/2/blog-thumb.jpg",
        "mainImage": "public/assets/images/blog/2/blog.jpg",
        "mainImageCredit": "",
        "title": "How to easily create blob shapes in Adobe Illustrator",
        "date": "04.11.2019",
        "summary": "Blob background shapes are such a trend and can be used in UI designs as well as in illustration presentations and today I am going to show you an easy way to create interesting shapes with a few clicks.",
        "category": "tutorials",
        "content": {
            "p0": "<p>Blob background shapes are such a trend and can be used in UI designs as well as in illustration presentations. There is a way to create one using the pen tool in Illustrator but today I am going to show you an easier way to create quite interesting and unexpected shapes with a couple of clicks. So let's get started!</p>",
            "p1": "<p><b>Step 1:</b> Lets start with creating a new document by going to <b>File → New</b>.</p>",
            "p2": "<p><b>Step 2:</b> Grab your <b>Rectangle tool (keyboard shortcut M)</b> and create a shape in your preferred size. If you want your blob to be more horizontally oriented, then create this kind of rectangle and vise versa.</p> <img data-pin-description='How to easily create blob shapes in Adobe Illustrator' data-pin-url='https://hhristova.com/#/blog/1' src='public/assets/images/blog/2/screen1.jpg' class='img-fluid pb-3 js-button--blog' data-toggle='modal' data-target='#modalPicture' value='Expand photo' role='button' data-img='public/assets/images/blog/2/screen1.jpg' />",
            "p3": "<p><b>Step 3:</b> Once you create the shape, select <b>Effect → Distort & Transform → Roughen.</b></p> <img data-pin-description='How to easily create blob shapes in Adobe Illustrator' data-pin-url='https://hhristova.com/#/blog/1' src='public/assets/images/blog/2/screen2.jpg' class='img-fluid pb-3 js-button--blog' data-toggle='modal' data-target='#modalPicture' value='Expand photo' role='button' data-img='public/assets/images/blog/2/screen2.jpg' />",
            "p4": "<p><b>Step 4:</b> When the window pops up, check the Preview box so you can see what's going on. By default, the Size is set to 5%, Detail is at 10 and Relative and Corner Points are selected. This creates very edgy effect. In order to create a blobby effect first reduce the Detail slider to 0. You will immediately see how the edges become smoother. Then select the Points to smooth and start playing with the Option. You can see that the bigger the option size, the more blobb-ish the shape become. Tweak the Option size until you get your desired look.</p> <img data-pin-description='How to easily create blob shapes in Adobe Illustrator' data-pin-url='https://hhristova.com/#/blog/1' src='public/assets/images/blog/2/screen3.jpg' class='img-fluid pb-3 js-button--blog' data-toggle='modal' data-target='#modalPicture' value='Expand photo' role='button' data-img='public/assets/images/blog/2/screen3.jpg' />",
            "p5": "<p><b>Tip:</b> You will notice that the maximum of the slider is 100px but you can write whatever number you want in the text box and it will take effect.</p>",
            "p6": "<p>Once the shape is ready, go to <b>Object → Expand Appearance</b> and you will get the finished shape with just four anchor points. Now you can easily move the anchor points using <b>the pen tool (keyboard shortcut P)</b> for additional adjustments.</p> <img data-pin-description='How to easily create blob shapes in Adobe Illustrator' data-pin-url='https://hhristova.com/#/blog/1' src='public/assets/images/blog/2/screen4.jpg' class='img-fluid pb-3 js-button--blog' data-toggle='modal' data-target='#modalPicture' value='Expand photo' role='button' data-img='public/assets/images/blog/2/screen4.jpg' /> <img data-pin-description='How to easily create blob shapes in Adobe Illustrator' data-pin-url='https://hhristova.com/#/blog/1' src='public/assets/images/blog/2/screen5.jpg' class='img-fluid pb-3 js-button--blog' data-toggle='modal' data-target='#modalPicture' value='Expand photo' role='button' data-img='public/assets/images/blog/2/screen5.jpg' />",
            "p7": "<p>I hope this short tutorial was useful. Thanks for reading and happy blobbing!</p>"
        }
    },
    {
        "id": "2",
        "thumb": "public/assets/images/blog/3/blog-thumb.jpg",
        "mainImage": "public/assets/images/blog/3/blog.jpg",
        "mainImageCredit": "",
        "title": "✨Wisdom of the day - Email subjects",
        "date": "07.11.2019",
        "summary": "Quick and easy tip that may be useful for your email campaigns.",
        "category": "tips",
        "content": {
            "p0": "<p>Whether you are running and email campaign or just sending a friendly email to your subscribers - here is one tip that may be helpful getting users attention right away.</p>",
            "p1": "<p><b>30 to 50 characters is an optimal amount length for the subject line for an email. And most importantly - keep in mind that the first 38 characters are displayed regardless of the monitor size.</b></p>",
            "p2": "<p>So the first 38 character, guys, this is where your magic should happen.</p>"
        }
    },
    {
        "id": "3",
        "thumb": "public/assets/images/blog/4/blog-thumb.jpg",
        "mainImage": "public/assets/images/blog/4/blog.jpg",
        "mainImageCredit": "",
        "title": "The everlasting question: Should designers know how to code?",
        "date": "19.11.2019",
        "summary": "<p>This is one of these questions that are always trendy and everyone has their own opinion about. So here is mine.</p>",
        "category": "blog",
        "content": {
            "p0": "<p><i>Just a small sidenote: when I say coding, I refer to front-end code — HTML, CSS, and some Javascript. I don't expect designers to be into the backend.</i> 🙂</p><p>So this is one of these questions that are always trendy and everyone has their own opinion about. Should we know how to code and how this ability is going to help us in our day-to-day job?</p><p>Yes, we should, and yes, it can only be an advantage for designers to have technical knowledge in the development field but only if the designer is passionate about it. I really believe that this is not something that we are obliged to learn and do (let's remember that the designers are <a href='https://www.thefreedictionary.com/right-brained' target='_blank'><strong>right brained</strong></a> people after all). Let me give you a few examples why I think we should spend some time in learning at least the code basics (or as in my case - a bit more than that).</p><h4 class='blogpost-subtitle'>1. Be more aware of the technical part of the process</h4><p> Or you better at least know what you don't know. To know how to code or just to be aware of the overall development process behind the design is a HUDE advantage. It gives the designers a wider perspective how the interactions / animations / experiences they are creating can be produced later from the dev team. Also it makes them more informed on the design decisions they make and help them understand the constraints of the digital world. In a nutshell if a designer can code he / she will have the ability to understand a developer’s perspective and as part of big teams and organizations we all know how important it is if our colleagues can step into our shoes sometimes. 🙂 </p><p>I also believe that the technical background (despite how wide or narrow it is) is adding value to designers point of view and can only enrich their processes and ideas. In my case learning code made me a much better Web Designer for sure.</p>",
            "p1": "<h4 class='blogpost-subtitle'>2. Easier communication with the dev team</h4><p> This advantage continues the previous one, just emphasizes on how important is not to waste a number of hours daily/weekly/monthly in debating your design decisions and trying to understand the developer in front of you (most of the time unsuccessfully 🤷‍).</p><p>Just imagine how these hours can be transformed into creating something meaningful and usable instead of having endless conversations the dev team. It may not sounds like a big deal but in a long term it can be extremely time consuming so it's better to have a common ground and language for communicating with each other.</p><h4 class='blogpost-subtitle'>3. You can create your own ideas<br><small><i>(Small or not so small scale web design projects)</i></small></h4><p>How many times you had one of these 'That would be the best project ever!' moments when you have an amazing idea but you know that you cannot create it all by yourself and this demotivates you right at the beginning? I had these moments before I once I started to learn coding I progressively become more and more confident that I can create my own ideas (and with the help of Stack Overflow of course) and little by little I started learning and developing my tech skills.</p><h4 class='blogpost-subtitle'>4. Application that impress</h4>",
            "p2": "<p>We live in quite a complicated world where each and every company is trying to find it's best candidates in the sea of Behance designers and Dribbble shots and likes. It may depends on the industry and the type of company but to have front-end skills in your CV can only help you pops out of the crowd just because it's not so common for designers.</p><p>Whether the position is about Visual Designer, Web Designer, UI/UX/Jack of all trades in the company Designer or an experienced UX Designer, the ads always contains familiarity with HTML and CSS in their requirements. Not to mention that if you are self-taught this means that you had a great motivation, ambition and organizational skills to transform your desire into useful skill under your belt - very strong competitive advantage, I would say.</p><h4 class='blogpost-subtitle'>5. It may help you with your side hustle</h4><p>No matter if you are planning to become a freelancer or you just need some extra money, the technical skillset can have a huge advantage for you both financially and in terms of time management. Especially in the field of freelancing you can use these skills to upsell your clients with additional services once your design work is done. Cool, huh? </p><h4 class='blogpost-subtitle'>Conclusion</h4><p>I know that there are lot's of designers out there who don't think that they need to know anything technical because it may kill their creativity or it's too complicated and time-consuming, but believe me when I say that you can only benefit from having these skills under your belt. And it doesn't need to be complicated and hard to understand, there are plenty of resources out there for absolute beginners where you can start from ABC's and can build from there till you feel comfortable and intrigued. Just give it a try!</p><p>Good luck and have fun!</p>"
        }
    }
]
