[
    {
        "id": "how-to-easily-extract-colors-from-image-in-adobe-photoshop",
        "thumb": "/public/assets/images/blog/how-to-easily-extract-colors-from-image-in-adobe-photoshop/blog-thumb.jpg",
        "mainImage": "/public/assets/images/blog/how-to-easily-extract-colors-from-image-in-adobe-photoshop/blog.jpg",
        "mainImageCredit": "Image by HHristova",
        "title": "How to Easily Extract Colors From Image in Adobe Photoshop",
        "date": "19.10.2019",
        "summary": "Тhere are plenty of websites which can offer to extract colors from images but I believe there is an easier way to do so by just opening Photoshop!",
        "category": "tutorials",
        "content": {
            "p0": "<p>We all have seen an image in pinterest or instagram and wanted to get the exact color palette the creator used for the artwork. Or for instance if it's a picture, you may be inspired by it's atmosphere and wanted to get the most out of it for your next project?</p>",
            "p1": "<p>Well, there are plenty of websites which can offer to extract color palette from images but I believe that there is a easier way to do so by opening Photoshop! So here is the trick:</p>",
            "p2": "<p>I will use an artwork from one of my favourite illustrators out there - <a class='font-weight-bold' href='https://www.lisaglanz.com/' target='_blank'>Lisa Glanz</a>. By opening this image in photoshop, you can go to <b>Filter</b> and select <b>Pixelate - Mosaic</b>.</p> <img src='/public/assets/images/blog/how-to-easily-extract-colors-from-image-in-adobe-photoshop/screen3.jpg' class='img-fluid pb-3 js-button--blog' data-toggle='modal' data-target='#modalPicture' value='Expand photo' role='button' data-img='/public/assets/images/blog/how-to-easily-extract-colors-from-image-in-adobe-photoshop/screen3.jpg' /> <p>Once you select it, the window will appear with option to select a cell size of the mosaic filter.</p> <p>What it basically do is it breaks the image into squares, averaging the color within each square (cells). And the larger the cell size, the larger the mosaic’s squares. In my example below I've used a cell size of 40 because it gives me the best color combination but you can experiment with your own settings depending of the image you are extracting the color palette from.</p> <p>My advice is to use cell size about 40-50 otherwise the colors will be endless or just a few.</p> <img src='/public/assets/images/blog/how-to-easily-extract-colors-from-image-in-adobe-photoshop/screen2.jpg' class='img-fluid pb-3 js-button--blog' data-toggle='modal' data-target='#modalPicture' value='Expand photo' role='button' data-img='/public/assets/images/blog/how-to-easily-extract-colors-from-image-in-adobe-photoshop/screen2.jpg' />",
            "p3": "<p><b>Tip:</b> You can also do this for a specific part of an image!</p><ol><li>Copy the section of the image you want to sample onto a new layer</li><li>Lock the layer’s transparency (the black and white square just above the layers in Layers panel)</li><li>And again apply Mosaic filter</li></ol>",
            "p4": "<p>Once you've applied the mosaic filter it's time to hand-picked the colors we want. Use the Eyedropper tool and select your first color. Then move your mouse over the Swatches palette and you will see that the icon turns from an Eyedropper to a Paint Bucket. With the Paint Bucket, click anywhere on the empty area of the Swatches’ Palette and you will create a new color-swatch square.</p> <p>Once you have selected and dropped your colors in the Swatches Palette, save the palette. Go to the Swatches Palette Options and select 'Save Swatches'.</p><img src='/public/assets/images/blog/how-to-easily-extract-colors-from-image-in-adobe-photoshop/screen1.jpg' class='img-fluid pb-3 js-button--blog' data-toggle='modal' data-target='#modalPicture' value='Expand photo' role='button' data-img='/public/assets/images/blog/how-to-easily-extract-colors-from-image-in-adobe-photoshop/screen1.jpg' /> <p>I hope this trick helps you to create a beautiful color combinations and artworks.</p>"
        },
        "pinImage": "/public/assets/images/blog/how-to-easily-extract-colors-from-image-in-adobe-photoshop/how-to-easily-extract-colors-from-image-in-adobe-photoshop-pin.jpg",
        "pinImageEncoded": "http%3A%2F%2Flocalhost%2Fpublic%2Fassets%2Fimages%2Fblog%2Fhow-to-easily-extract-colors-from-image-in-adobe-photoshop%2Fhow-to-easily-extract-colors-from-image-in-adobe-photoshop-pin.jpg"
    },
    {
        "id": "how-to-easily-create-blob-shapes-in-adobe-illustrator",
        "thumb": "/public/assets/images/blog/how-to-easily-create-blob-shapes-in-adobe-illustrator/blog-thumb.jpg",
        "mainImage": "/public/assets/images/blog/how-to-easily-create-blob-shapes-in-adobe-illustrator/blog.jpg",
        "mainImageCredit": "Image by HHristova",
        "title": "How to Easily Create Blob Shapes in Adobe Illustrator",
        "date": "04.11.2019",
        "summary": "Blob background shapes are such a trend and can be used in UI designs as well as in illustration presentations and today I am going to show you an easy way to create interesting shapes with a few clicks.",
        "category": "tutorials",
        "content": {
            "p0": "<p>Blob background shapes are such a trend and can be used in UI designs as well as in illustration presentations. There is a way to create one using the pen tool in Illustrator but today I am going to show you an easier way to create quite interesting and unexpected shapes with a couple of clicks. So let's get started!</p>",
            "p1": "<p><b>Step 1:</b> Lets start with creating a new document by going to <b>File → New</b>.</p>",
            "p2": "<p><b>Step 2:</b> Grab your <b>Rectangle tool (keyboard shortcut M)</b> and create a shape in your preferred size. If you want your blob to be more horizontally oriented, then create this kind of rectangle and vise versa.</p> <img src='/public/assets/images/blog/how-to-easily-create-blob-shapes-in-adobe-illustrator/screen1.jpg' class='img-fluid pb-3 js-button--blog' data-toggle='modal' data-target='#modalPicture' value='Expand photo' role='button' data-img='/public/assets/images/blog/how-to-easily-create-blob-shapes-in-adobe-illustrator/screen1.jpg' />",
            "p3": "<p><b>Step 3:</b> Once you create the shape, select <b>Effect → Distort & Transform → Roughen.</b></p> <img src='/public/assets/images/blog/how-to-easily-create-blob-shapes-in-adobe-illustrator/screen2.jpg' class='img-fluid pb-3 js-button--blog' data-toggle='modal' data-target='#modalPicture' value='Expand photo' role='button' data-img='/public/assets/images/blog/how-to-easily-create-blob-shapes-in-adobe-illustrator/screen2.jpg' />",
            "p4": "<p><b>Step 4:</b> When the window pops up, check the Preview box so you can see what's going on. By default, the Size is set to 5%, Detail is at 10 and Relative and Corner Points are selected. This creates very edgy effect. In order to create a blobby effect first reduce the Detail slider to 0. You will immediately see how the edges become smoother. Then select the Points to smooth and start playing with the Option. You can see that the bigger the option size, the more blobb-ish the shape become. Tweak the Option size until you get your desired look.</p> <img src='/public/assets/images/blog/how-to-easily-create-blob-shapes-in-adobe-illustrator/screen3.jpg' class='img-fluid pb-3 js-button--blog' data-toggle='modal' data-target='#modalPicture' value='Expand photo' role='button' data-img='/public/assets/images/blog/how-to-easily-create-blob-shapes-in-adobe-illustrator/screen3.jpg' />",
            "p5": "<p><b>Tip:</b> You will notice that the maximum of the slider is 100px but you can write whatever number you want in the text box and it will take effect.</p>",
            "p6": "<p>Once the shape is ready, go to <b>Object → Expand Appearance</b> and you will get the finished shape with just four anchor points. Now you can easily move the anchor points using <b>the pen tool (keyboard shortcut P)</b> for additional adjustments.</p> <img src='/public/assets/images/blog/how-to-easily-create-blob-shapes-in-adobe-illustrator/screen4.jpg' class='img-fluid pb-3 js-button--blog' data-toggle='modal' data-target='#modalPicture' value='Expand photo' role='button' data-img='/public/assets/images/blog/how-to-easily-create-blob-shapes-in-adobe-illustrator/screen4.jpg' /> <img src='/public/assets/images/blog/how-to-easily-create-blob-shapes-in-adobe-illustrator/screen5.jpg' class='img-fluid pb-3 js-button--blog' data-toggle='modal' data-target='#modalPicture' value='Expand photo' role='button' data-img='/public/assets/images/blog/how-to-easily-create-blob-shapes-in-adobe-illustrator/screen5.jpg' />",
            "p7": "<p>I hope this short tutorial was useful. Thanks for reading and happy blobbing!</p>"
        },
        "pinImage": "/public/assets/images/blog/how-to-easily-create-blob-shapes-in-adobe-illustrator/how-to-easily-create-blob-shapes-in-adobe-illustrator-pin.jpg",
        "pinImageEncoded": "http%3A%2F%2Flocalhost%2Fpublic%2Fassets%2Fimages%2Fblog%2Fhow-to-easily-create-blob-shapes-in-adobe-illustrator%2Fhow-to-easily-create-blob-shapes-in-adobe-illustrator-pin.jpg"
    },
    {
        "id": "wisdom-of-the-day-email-subjects",
        "thumb": "/public/assets/images/blog/wisdom-of-the-day-email-subjects/blog-thumb.jpg",
        "mainImage": "/public/assets/images/blog/wisdom-of-the-day-email-subjects/blog.jpg",
        "mainImageCredit": "Image by HHristova",
        "title": "✨Wisdom of the Day - Email Subjects",
        "date": "07.11.2019",
        "summary": "Quick and easy tip that may be useful for your email campaigns.",
        "category": "tips",
        "content": {
            "p0": "<p>Whether you are running and email campaign or just sending a friendly email to your subscribers - here is one tip that may be helpful getting users attention right away.</p>",
            "p1": "<p><b>30 to 50 characters is an optimal amount length for the subject line for an email. And most importantly - keep in mind that the first 38 characters are displayed regardless of the monitor size.</b></p>",
            "p2": "<p>So the first 38 character, guys, this is where your magic should happen.</p>"
        },
        "pinImage": "/public/assets/images/blog/wisdom-of-the-day-email-subjects/wisdom-of-the-day-email-subjects-pin.jpg",
        "pinImageEncoded": "http%3A%2F%2Flocalhost%2Fpublic%2Fassets%2Fimages%2Fblog%2Fwisdom-of-the-day-email-subjects%2Fwisdom-of-the-day-email-subjects-pin.jpg"
    },
    {
        "id": "the-everlasting-question-should-designers-know-how-to-code",
        "thumb": "/public/assets/images/blog/the-everlasting-question-should-designers-know-how-to-code/blog-thumb.jpg",
        "mainImage": "/public/assets/images/blog/the-everlasting-question-should-designers-know-how-to-code/blog.jpg",
        "mainImageCredit": "Drawing by HHristova",
        "title": "The Everlasting Question: Should Designers Know How to Code?",
        "date": "19.11.2019",
        "summary": "<p>This is one of these questions that are always trendy and everyone has their own opinion about. So here is mine.</p>",
        "category": "blog",
        "content": {
            "p0": "<br><p><i>Just a small sidenote: when I say coding, I refer to front-end code — HTML, CSS, and some Javascript. I don't expect designers to be into the backend.</i> 🙂</p><p>So this is one of these questions that are always trendy and everyone has their own opinion about. Should we know how to code and how this ability is going to help us in our day-to-day job?</p><p>Yes, we should, and yes, it can only be an advantage for designers to have technical knowledge in the development field but only if the designer is passionate about it. I really believe that this is not something that we are obliged to learn and do (let's remember that the designers are <a href='https://www.thefreedictionary.com/right-brained' target='_blank'><strong>right brained</strong></a> people after all). Let me give you a few examples why I think we should spend some time in learning at least the code basics (or as in my case - a bit more than that).</p><h4 class='pt-3 pb-2 blogpost-subtitle'>1. Be more aware of the technical part of the process</h4><p> Or you better at least know what you don't know. To know how to code or just to be aware of the overall development process behind the design is a HUDE advantage. It gives the designers a wider perspective how the interactions / animations / experiences they are creating can be produced later from the dev team. Also it makes them more informed on the design decisions they make and help them understand the constraints of the digital world. In a nutshell if a designer can code he / she will have the ability to understand a developer’s perspective and as part of big teams and organizations we all know how important it is if our colleagues can step into our shoes sometimes. 🙂 </p><p>I also believe that the technical background (despite how wide or narrow it is) is adding value to designers point of view and can only enrich their processes and ideas. In my case learning code made me a much better web designer for sure.</p>",
            "p1": "<h4 class='pt-3 pb-2 blogpost-subtitle'>2. Easier communication with the dev team</h4><p> This advantage continues the previous one, just emphasizes on how important is not to waste a number of hours daily / weekly / monthly in debating your design decisions and trying to understand the developer in front of you (most of the time unsuccessfully 🤷‍).</p><p>Just imagine how these hours can be transformed into creating something meaningful and usable instead of having endless conversations the dev team. It may not sounds like a big deal but in a long term it can be extremely time consuming so it's better to have a common ground and language for communicating with each other.</p><h4 class='pt-3 pb-2 blogpost-subtitle'>3. You can create your own ideas<br><small>(Small or not so small scale projects)</small></h4><p>How many times you had one of these 'That would be the best project ever!' moments when you have an amazing idea but you know you cannot create it all by yourself and this demotivates you right at the beginning? I had these moments before I once I started to learn coding I progressively become more and more confident that I can create my own ideas (and with the help of Stack Overflow of course) and little by little I started learning and developing my tech skills.</p><h4 class='pt-3 pb-2 blogpost-subtitle'>4. Application that impress</h4>",
            "p2": "<p>We live in quite a complicated world where each and every company is trying to find it's best candidates in the sea of Behance designers and Dribbble shots and likes. It may depends on the industry and the type of company but to have front-end skills in your CV can only help you pops out of the crowd just because it's not so common for designers.</p><p>Whether the position is about Visual Designer, Web Designer, UI / UX / Jack of all trades Designer, the ads always contains familiarity with HTML and CSS in their requirements. Not to mention that if you are self-taught this means that you had a great motivation, ambition and organizational skills to transform your desire into useful skill under your belt - very strong competitive advantage I would say.</p><h4 class='pt-3 pb-2 blogpost-subtitle'>5. It may help you with your side hustle</h4><p>No matter if you are planning to become a freelancer or you just need some extra money, the technical skillset can have a huge advantage for you both financially and in terms of time management. Especially in the field of freelancing you can use these skills to upsell your clients with additional services once your design work is done. Cool, huh? </p><h4 class='pt-3 pb-2 blogpost-subtitle'>Conclusion</h4><p>I know that there are lot's of designers out there who don't think that they need to know anything technical because it may kill their creativity or it's too complicated and time-consuming, but believe me when I say that you can only benefit from having these skills under your belt. And it doesn't need to be complicated and hard to understand, there are plenty of resources out there for absolute beginners where you can start from ABC's and can build from there till you feel comfortable and intrigued. Just give it a try!</p><p>Good luck and have fun creating!</p>"
        },
        "pinImage": "/public/assets/images/blog/the-everlasting-question-should-designers-know-how-to-code/the-everlasting-question-should-designers-know-how-to-code-pin.jpg",
        "pinImageEncoded": "http%3A%2F%2Flocalhost%2Fpublic%2Fassets%2Fimages%2Fblog%2Fthe-everlasting-question-should-designers-know-how-to-code%2Fthe-everlasting-question-should-designers-know-how-to-code-pin.jpg"
    },
    {
        "id": "9-free-christmas-fonts-to-use-this-season",
        "thumb": "/public/assets/images/blog/9-free-christmas-fonts-to-use-this-season/blog-thumb.jpg",
        "mainImage": "/public/assets/images/blog/9-free-christmas-fonts-to-use-this-season/blog.jpg",
        "mainImageCredit": "Photo by Aaron Burden on Unsplash",
        "title": "9 Best Free Christmas Fonts to Use This Season",
        "date": "28.11.2019",
        "summary": "<p>The most magical time of the year is here! And so is my selection of lovely and free festive fonts.</p>",
        "category": "blog",
        "content": {
            "p0": "<p>The most magical time of the year is here! Christmas is knocking on our door so whether you are creating Christmas cards for your family and your loved ones or just need some festive sparkles in your day, these ideas will help you find what you are looking for. Let's dive in!</p><h4 class='pt-3 pb-2 blogpost-subtitle'>1. <a href='https://www.dafont.com/snowballs.font' target='_blank'>Snowballs by StereoType</a></h4><a href='https://www.dafont.com/snowballs.font' target='_blank'><img class='img-fluid' src='/public/assets/images/blog/9-free-christmas-fonts-to-use-this-season/snowballs.jpg' alt='Snowballs by StereoType free font'></a><p class='pt-3'>This flourishy and festive Christmas font will definitely makes your design stands out. It's a great option for greeting cards or holiday wishes because it's readability is quite good even in smaller size.</p><p>Just keep in mind it's 100% free for personal use only.</p><h4 class='pt-3 pb-2 blogpost-subtitle'>2. <a href='https://www.dafont.com/reindeer-christmas.font' target='_blank'>Reindeer Christmas by Typhoon Type - Suthi Srisopha</a></h4><a href='https://www.dafont.com/reindeer-christmas.font' target='_blank'><img class='img-fluid' src='/public/assets/images/blog/9-free-christmas-fonts-to-use-this-season/reindeer-christmas.jpg' class='img-fluid' alt='Reindeer Christmas by Typhoon Type - Suthi Srisopha free font' /></a><p class='pt-3'>This lovely script font with a nice textures is going to bring your festive mood right away. It also comes with a handy pair of horns as special characters you can add to your letters. It can be used for big and medium sizes without losing it's readibility.</p><p>The font is 100% for personal use.</p><h4 class='pt-3 pb-2 blogpost-subtitle'>3. <a href='https://www.dafont.com/kingthings-christmas.font' target='_blank'>Kingthings Christmas by Kingthings</a></h4><a href='https://www.dafont.com/kingthings-christmas.font' target='_blank'><img class='img-fluid' src='/public/assets/images/blog/9-free-christmas-fonts-to-use-this-season/kingthings-christmas.jpg' class='img-fluid' alt='Kingthings Christmas by Kingthings free font' /></a><p class='pt-3'>My third choice is more caligraphic font that perfectly combines elegance with the festive mood of incoming holidays. Again, this font is better used for a large elements such as titles for web elements or greeting cards so it's beautiful details can shine.</p><p>Again it's totally free for personal and comercial use so jump right in!</p><h4 class='pt-3 pb-2 blogpost-subtitle'>4. <a href='https://www.fontsquirrel.com/fonts/mountains-of-christmas' target='_blank'>Mountains Of Christmas by Tart Workshop</a></h4><a href='https://www.fontsquirrel.com/fonts/mountains-of-christmas' target='_blank'><img class='img-fluid' src='/public/assets/images/blog/9-free-christmas-fonts-to-use-this-season/mountains-of-christmas.jpg' class='img-fluid' alt='Mountains Of Christmas by Tart Workshop free font' /></a><p class='pt-3'>This funny and quirky font is great for all kinds of Christmas ideas you can come up with! It can work well in various sizes and can give your project the playful mood you may look for.</p><p>And another important thing - it is 100% free for personal and commercial use!</p><h4 class='pt-3 pb-2 blogpost-subtitle'>5. <a href='https://www.dafont.com/pwhappychristmas.font' target='_blank'>PW Joyeux Noel by Peax Webdesign</a></h4><a href='https://www.dafont.com/pwhappychristmas.font' target='_blank'><img class='img-fluid' src='/public/assets/images/blog/9-free-christmas-fonts-to-use-this-season/pw-joyeux-noel.jpg' class='img-fluid' alt='PW Joyeux Noel by Peax Webdesign free font' /></a><p class='pt-3'>The playfulness of this font is so amazing that you will fall in love with it for sure. It can be a great choice for your funny greeting card to the colleagues or for your children. With it's snowy covered letters this font is yelling 'Christmas' at us so the holiday mood is 100% guaranteed.</p><p>As the rest of the fonts, this one is also 100% free for any usage.</p><h4 class='pt-3 pb-2 blogpost-subtitle'>6. <a href='https://www.dafont.com/christmas-flakes.font' target='_blank'>Christmas / Flakes by Randy Ford</a></h4><a href='https://www.dafont.com/christmas-flakes.font' target='_blank'><img class='img-fluid' src='/public/assets/images/blog/9-free-christmas-fonts-to-use-this-season/christmas-flakes.jpg' class='img-fluid' alt='Christmas / Flakes by Randy Ford free font' /></a><p class='pt-3'>Christmas Flakes is a great option for more conservative designs that need just a tiny details to point out the Christmas days. The font is especially designed for large scales usage so you better rely on it for titles and big heading in your web projects.</p><p>It's totally free - just download and use it.</p><h4 class='pt-3 pb-2 blogpost-subtitle'>7. <a href='https://www.dafont.com/candy-cane.font' target='_blank'>Candy Cane by Michel Bujardet</a></h4><a href='https://www.dafont.com/candy-cane.font' target='_blank'><img class='img-fluid' src='/public/assets/images/blog/9-free-christmas-fonts-to-use-this-season/candy-cane.jpg' class='img-fluid' alt='Candy Cane by Michel Bujardet free font' /></a><p class='pt-3'>This whimsical and sweet font is a great (and delicious!) choice for your playful ideas. Candy Cane is designed for all types of sizes so you can use it everywhere, just don't forget to count the calories! 😋</p><p>Keep in mind that it's free for personal use only.</p><h4 class='pt-3 pb-2 blogpost-subtitle'>8. <a href='https://www.fontspace.com/m%C3%A5ns-greb%C3%A4ck/christmas-sparkle-personal-use' target='_blank'>Christmas Sparkle by Måns Grebäck</a></h4><a href='https://www.fontspace.com/m%C3%A5ns-greb%C3%A4ck/christmas-sparkle-personal-use' target='_blank'><img class='img-fluid' src='/public/assets/images/blog/9-free-christmas-fonts-to-use-this-season/christmas-sparkle.jpg' class='img-fluid' alt='Christmas Sparkle by Måns Grebäck free font' /></a><p class='pt-3'>Here is another scripty and festive font that can work wonderfully well for every design project you started. It's again more or less designed for bigger sizes and it's beauty and small details pop out when it's used as a title.</p><p>The font is free for personal use.</p><h4 class='pt-3 pb-2 blogpost-subtitle'>9. <a href='https://www.dafont.com/miraculous-christmas.font' target='_blank'>Miraculous Christmas by Cat.B</a></h4><a href='https://www.dafont.com/miraculous-christmas.font' target='_blank'><img class='img-fluid' src='/public/assets/images/blog/9-free-christmas-fonts-to-use-this-season/miraculous-christmas.jpg' class='img-fluid' alt='Miraculous Christmas by Cat.B free font' /></a><p class='pt-3'>And the last one is also a script type font with a great texture and lovely flourishes that can grab your attention instantly. It also contains a symbol of a snowman that can be used as part of your letters.</p><p>Have fun with it and keep in mind that it's 100% for personal use only.</p><p>I hope you have find what you've been looking for.</p><h4>Have a wonderful Christmas! ❄️</h4>"
        },
        "pinImage": "/public/assets/images/blog/9-free-christmas-fonts-to-use-this-season/9-free-christmas-fonts-to-use-this-season-pin.jpg",
        "pinImageEncoded": "http%3A%2F%2Flocalhost%2Fpublic%2Fassets%2Fimages%2Fblog%2F9-free-christmas-fonts-to-use-this-season%2F9-free-christmas-fonts-to-use-this-season-pin.jpg"
    },
    {
        "id": "5-ways-to-stay-up-to-date-in-the-creative-field",
        "thumb": "/public/assets/images/blog/5-ways-to-stay-up-to-date-in-the-creative-field/blog-thumb.jpg",
        "mainImage": "/public/assets/images/blog/5-ways-to-stay-up-to-date-in-the-creative-field/blog.jpg",
        "mainImageCredit": "Photo by Jessica Lewis on Unsplash",
        "title": "5 Ways to Stay up-to-date in the Creative Field",
        "date": "25.12.2019",
        "summary": "<p>One of the key ingredients to be a successful designer is to stay at the very top of everything design-related that happens out there. Here is how I do it.</p>",
        "category": "blog",
        "content": {
            "p0": "<div class='max-chars blog-content'><p>One of the key ingredients to be a successful designer is to stay at the very top of everything design-related that happens out there. It may be easier for some and hard for others but I will give you my ways for staying informed in the dynamic design world.</p><h4 class='pt-3 pb-2 blogpost-subtitle'>1. Colleagues and friends</h4><p>One of the easiest and most efficient ways to find out about the design trends out there is to have people around you who can spread the word. What do they find this morning on Youtube or Dribbble, what do they try and find out about the latest Adobe update, these people can be a great source of information.</p><h4 class='pt-3 pb-2 blogpost-subtitle'>2. Create social media circle with interesting people and usefull content</h4><p>Let be honest here and calculate how many hours a day we spend scrolling on social media. I stopped using Facebook two years ago and since Messenger is still one of my main ways for communication I don't scroll through my feed just to see another set of smiley faces on Thailand and the delicious dinner of my highschool classmates (Sorry guys!). So the best way to spend your social media time meaningfully is to find and follow your favourite designers, artists, teachers, marketers, whatever you are interested in! Don't know where to start from? Go to Discover section on Instagram for instance.</p><h4 class='pt-3 pb-2 blogpost-subtitle'>3. Local events and communities</h4><p>If you are from the other people, who don't have design friends and feel like they don't have anyone to talk about design to, then you definitely need to look for a design events in your town. There are plenty of apps (Meetup, Eventful, AllEvents) for finding your preferred events and topics so you don't have an excuse not to participate! Not to mention how many amazing fellow designers you can meet there and what valuable information you can gather from the event. Events such as Dribbble meetups for instance happened all over the world so go and become part of the community!</p><p>If there are no events in your area, don't panic - you can always search on social medias for online design community so even if there are no organized events, you can share knowledge, give/ receive constructive feedback and be aware of the design environment around you.</p><h4 class='pt-3 pb-2 blogpost-subtitle'>4. Workshops, conferences and webinars</h4><p>Our generation is blessed with plenty of opportunities to see and learn from the best designers in the world via workshops, conferences or online courses and webinars. Just find what you want to learn and save the date for some education. Conferences are definitely one of my favourite way of learning new things because there are lots of lectors and different topics covered for a day or two and sometimes you can find a hidden treasure you didn't know even exist!</p><h4 class='pt-3 pb-2 blogpost-subtitle'>5. Subscribe for interesting websites, blogs and services</h4><p>Find the websites that are most interesting for you and subscribe for their daily/weekly/monthly newsletters, this is the best way to receive the latest news directly into your inbox. It's applicable for your favourite services as well, despite the spam that they can send you from time to time, this is a great way to learn for an upcoming update, to stay in the loop for their conferences and to read some interesting articles from their design team (inVision are a great example of that).</p><p>Here are some of my all time web design favs:<ul><li><a href='https://www.webdesignernews.com/' target='_blank' class='font-weight-bold'>Webdesigner News</a> - The platform is similar to reddit with option to vote for news and their daily newsletter contains everything new and exiting in the design field.</li><li><a href='https://tympanus.net/codrops/' target='_blank' class='font-weight-bold'>Codrops</a> - It is an awesome weekly newsletter full with web design and dev related news.</li><li><a href='https://www.webdesignerdepot.com/' target='_blank' class='font-weight-bold'>Webdesigner Depot</a> - Another great weekly source of design information.</li><li><a href='https://ewebdesign.com/' target='_blank' class='font-weight-bold'>eWebDesign</a> - This website may not look very impressive but their weekly newsletter is one of the best I've ever subscribed to. It's full with usefull articles, tricks and freebies from the design world.</li><li><a href='https://www.invisionapp.com/' target='_blank' class='font-weight-bold'>InVision</a> - There is no doubt that our lovely Invision friends will create something awesome. Their weekly newsletter contains interesting livestreams hosted by them during the week and trendy design news.</li></ul></p><h4 class='pt-3 pb-2 blogpost-subtitle'><b>Pro Tip:</b> Filter your reading information and concentrate on what is important for you</h4><p>After all the ideas, here is a tip that will keep you away from information overload. Always filter what you read and spend your time rationally. Don't read everything just for the sake of being informed, choose what is in your best interest and concentrate on it so the information will help you grow as a designer and will make your point of view wider.</p><p>Let's face it, we all have some sort of impostor syndrom and while learning more and more, we become even more insecure in our own abilities and knowledge, but the most important part of this is to always remember that there is no one who knows everything and we all have a talent in ourserves, just cannot see it clearly because we live with it. :)</p><p>So don't stop learning and self-develop, friends!</p></div>"
        },
        "pinImage": "/public/assets/images/blog/5-ways-to-stay-up-to-date-in-the-creative-field/5-ways-to-stay-up-to-date-in-the-creative-field-pin.jpg",
        "pinImageEncoded": "http%3A%2F%2Flocalhost%2Fpublic%2Fassets%2Fimages%2Fblog%2F5-ways-to-stay-up-to-date-in-the-creative-field%2F5-ways-to-stay-up-to-date-in-the-creative-field-pin.jpg"
    },
    {
        "id": "finding-inspiration-for-future-projects",
        "thumb": "/public/assets/images/blog/finding-inspiration-for-future-projects/blog-thumb.jpg",
        "mainImage": "/public/assets/images/blog/finding-inspiration-for-future-projects/blog.jpg",
        "mainImageCredit": "Illustration by HHristova",
        "title": "Finding Inspiration for Future Projects",
        "date": "10.02.2020",
        "summary": "<p>As a creatives we sometimes suffer from creative blocks or some really bad moods that prevent us from creating something beautiful. Here are the tips that help me in this.</p>",
        "category": "blog",
        "content": {
            "p0": "<div class='max-chars blog-content'><p>As a creatives we sometimes suffer from creative blocks or some really bad moods that prevent us from creating something beautiful. How many times you have find yourself on a white canvas or a blank piece of paper, wondering how to start your project (illustration, UI design, poster, whatever)? Or maybe you've experienced a period of empathy about your work without a specific reason?</p><p>I believe these things are common for all the creatives no matter illustrators, web designers or 3D artists. We all are just humans, and we have our ups and downs, so how can we minimize this moments and is it possible to avoid them as a whole? Here are the tips that help me in this.</p><h4 class='pt-3 pb-2 blogpost-subtitle'>1. Write down ideas whenever they come up.</h4><p>I guess you've heard lots of stories about great ideas coming when people are in the shower or maybe it happened to you? When I was in my first weeks at the university I had to create a book cover. It was very tough time for me and I had no ideas for days when suddenly, one day under the shower I've got the 'Aha!' moment for what should I draw and that lately become the main element of the final piece. That's why it's a great habit to write down your ideas once they came up. For instance, I wrote down mine right after I was out of the bathroom. It helps not to forget them after a day or two when you can actually work on them and once written down, they stop filling your brain’s 'RAM memory' so you can use the free space for another amazing thoughts. 🙂</p><p>Don't forget to leave a notebook next to your bed, I am sure you've already had a bunch of ideas just before sleep but once you've waked up in the morning they were all gone (or at least I have that experience). There are some people who even have a waterproof sticky notes for using under the shower but it's too much for me, I have to admit. 🙃</p><h4 class='pt-3 pb-2 blogpost-subtitle'>2. Create moodboards or collect favourite pieces.</h4><p>Moodboards are a great way to accumulate ideas and directions for your present or future design projects. I am trying to always save everything that stands out for me in Google Drive if I am on the go, so I can check it later or get inspired by it when I need it. The moodboards in general can contain color palettes, specific styles, feelings, combination of medias or just a good compositions. You can also write words if this is what is going to help creatively. Some freelance designers even send their moodboards as part of their design projects to the client.</p><p>The same idea can be translated into the offline world. Lovely greeting card, a great pattern on a sheet, delicate flower leaf or an interesting texture, you can always take a picture or collect them for inspirations and future reference.</p><h4 class='pt-3 pb-2 blogpost-subtitle'>3. Spend time away from the keyboard.</h4><p>Let's face it, the impostor syndrome sometimes strikes us badly when scrolling on our Dribbble or Behance feed and see how others are doing amazing stuff while we don't know where to start. This is not helping, in fact, it can demotivates us even more! So that is the time when being away from the whole attention-seeking madness and colorful jungle can actually make your next work happen! Meet with friends, go for a walk, talk with your mom, anything that gives your brain a break will have a great effect over your imagination and next time when you sit in front of the screen, you will be more able to actually start working.</p><h4 class='pt-3 pb-2 blogpost-subtitle'>4. Start doodleling without a specific idea.</h4><p>This one is more applicable for illustrations, rather than UI designs but you may interpret it in our own way. The technique helps me a lot, especially when I don’t expect anything to come out of it, and I am completely out of ideas. I just start drawing random lines and create shapes until I've decide that the creation starts to look like an actual thing. When this happened, then I have a starting point for my drawing and here it is - the white canvas is gone and I have a direction for my next piece.</p><h4 class='pt-3 pb-2 blogpost-subtitle'>5. Read books, listen new music and explore different and new areas of life.</h4><p>Consuming different kinds of useful information and getting experience from others in a various ways is a great thing we can do to ourselves as a human beings and as a designers. Reading books and listening to music makes the mind to wander and as we know 'mind-wandering is a mental state in which we detach ourselves from the activity at hand, leaving our thoughts free to roam without conscious direction'. It's the same with every other area in life where you can leave your mind to just wander. We can image it as a reset button and a refresh boost for our mind. These moments and spent time are like drops in your brain reservoir, and we need to fill it in regularly. The wider the perspective is, the better the future ideas are going to be.</p><h4 class='pt-3 pb-2 blogpost-subtitle'>6. Travel (in your hometown or abroad), explore new places, new people and new senses.</h4><p>This one can continue the previous tip but this is more interaction-based experience. In September last year me and my boyfriend went to an architectural tour in Sofia (the town where I live since 2013). I didn't know what to expect, but I was completely amazed by the buildings I've seen, the ornaments and the stories I've heard. This was the first time when I felt like a tourist in Sofia and it opens my eyes for all the beauty we don't notice wherever we live because we are always in a hurry. The point is that if I need to draw a building in a <a class='font-weight-bold' href='https://en.wikipedia.org/wiki/Vienna_Secession' target='_blank'>Secession</a> style now, I would know where to seek inspiration and what should I find online. It's the same with finding a new place, trying a new dish, everything is just a tiny element of our enormous database, and we need to update it regularly so it can work for us properly when needed.</p><h4 class='pt-3 pb-2 blogpost-subtitle'>7. Inspiration does exist but it must find you working.</h4><p>Picasso have said it wisely. Despite all the ideas and tips we can find online, there is one thing for sure - if we don't start, we will never get to the final. So sometimes, despite all the black holes, lack of ideas or whatever, just start trying and it may work much better that you've expected at the beginning.</p><p>Happy designing, friends!</p></div>"
        },
        "pinImage": "/public/assets/images/blog/finding-inspiration-for-future-projects/finding-inspiration-for-future-projects-pin.jpg",
        "pinImageEncoded": "http%3A%2F%2Flocalhost%2Fpublic%2Fassets%2Fimages%2Fblog%2Ffinding-inspiration-for-future-projects%2Ffinding-inspiration-for-future-projects-pin.jpg"
    }
]
