[
    {
        "id": "cosmetic-website-design",
        "thumb": "/assets/images/myWork/web-design/experimental-cosmetic-thumb.jpg",
        "url": "/assets/images/myWork/web-design/experimental-cosmetic.png",
        "title": "Cosmetic website design",
        "content": "<div class='project-subtitle'>About the project:</div><p>One of my side-project designs for creating a cosmetic landing page to a LARQ brand. The green and the orange color palette was used for creating a contrast to the white brand products and it's main goal was to bring a feel of refreshment and movement to the user.</p> <div class='project-subtitle'>My role:</div><p>UI design</p>",
        "content2": "",
        "filterId": "webdesign"
    },
    {
        "id": "quotopia-app-design",
        "thumb": "/assets/images/myWork/web-design/quotopia-app-thumb.jpg",
        "url": "/assets/images/myWork/web-design/quotopia-app.jpg",
        "title": "Quotopia app design screens",
        "content": "<div class='project-subtitle'>About the project:</div><p>This is one of my side projects that I am still working on in collaboration with a full-stack developer. The idea behind the project is to create a mobile application that can give the users a bits of wisdom everyday in a shape of random quotes from famious (and not so famous) people.</p> <div class='project-subtitle'>My role:</div><p>UI design</p>",
        "content2": "",
        "filterId": "webdesign"
    },
    {
        "id": "go-tenant-redesign",
        "thumb": "/assets/images/myWork/web-design/gt-redesign-thumb.jpg",
        "url": "/assets/images/myWork/web-design/gt-redesign.jpg",
        "title": "Landing page of Go Tenant! - UK property management platform that helps the landlords to stay compliant",
        "content": "<div class='project-subtitle'>About the project:</div><p>Go Tenant! is a property management software will helps a landlords in United Kingdom to stay compliant in the whole process of renting their homes to potential tenants.</p><div class='project-subtitle'>My role:</div><p>User research, prototyping, UI design<br>Build the product from skratch</p><div class='project-subtitle'>Main goal:</div><p>The rental process in UK requires good management and contains plenty of documents and legal steps so the main aim was to create a smooth and easy flow for the landlords to rent their homes completely paperless and entirely online so they can save their time and potential struggles dealing with the whole renting process.</p>",
        "content2": "<div class='d-flex flex-wrap flex-sm-nowrap align-items-center py-3 py-xl-5'><img class='img-fluid w-40 mb-3 mb-lg-0 mr-md-3 mr-xl-5' src='/assets/images/myWork/web-design/gt-screenshot.jpg' alt='Landing page design' /><div><p>As part of the exploration and research processes, we went with this arty style for the header with the green color, which is the primary color of the whole platform.</p><p>The art style of the platform as well as the green color are used in order to make the user feel more relaxed when visiting the website and to build trust into the system.</p><p>Since there are lots of information that the users need to read before making their decision to subscribe, I tried to use as many visuals to accompanied the content, as possible.</p></div></div><img class='img-fluid pt-5' src='/assets/images/myWork/web-design/gt-screenshot2.png' alt='Landing page design' />",
        "filterId": "webdesign"
    },
    {
        "id": "eqology-website-concept",
        "thumb": "/assets/images/myWork/web-design/eq-design-thumb2.jpg",
        "url": "/assets/images/myWork/web-design/eqology-website-concept-v2.jpg",
        "title": "Landing page design for scandinavian company",
        "content": "<div class='project-subtitle'>About the company:</div><p>Eqology is a network marketing company established in Norway in 1998. The name Eqology is a compound of EQ and Eqcology and the story it tells is both about the products, which are all based on natural ingredients, and on the unique forces nature can offer.</p><div class='project-subtitle'>My role:</div><p>UI design</p><div class='project-subtitle'>Main goal:</div><p>The aim of the project was to simplify the design and to emphasize on the products and increase overall sales. Since the company branding was already created I used their style guide (colors, typefaces, buttons, etc.) in order to create the final artwork.</p>",
        "content2": "",
        "filterId": "webdesign"
    },
    {
        "id": "psp-webtech-website-design",
        "thumb": "/assets/images/myWork/web-design/psp-design-thumb.jpg",
        "url": "/assets/images/myWork/web-design/psp-webtech-site-design.jpg",
        "title": "Corporate landing page design",
        "content": "<div class='project-subtitle'>About the company:</div><p>PSP is a UK based company that offers software solutions and software for small businesses that allow them to run and market their own business.</p><div class='project-subtitle'>My role:</div><p>UI design</p><div class='project-subtitle'>Main goal:</div><p>Create brand new website that can catch potential employees and presents the company's identity in a friendly way.</p><p>Since the company headquarter is in United Kingdom and the main website has a strong corporate feel and content, the main idea was to present the second office of the company - the team in Bulgaria, the main stack that they use on a daily basis and to list the vacant job positions in simple and minimalistic way that can speak well with the potential employees and people that need to know more about the company.</p><img class='img-fluid' src='/assets/images/myWork/web-design/corporate-screenshots.png' alt='Corporate landing page design' />",
        "content2": "",
        "filterId": "webdesign"
    },
    {
        "id": "eqology-website-concept-v2",
        "thumb": "/assets/images/myWork/web-design/eq-design-thumb.jpg",
        "url": "/assets/images/myWork/web-design/eqology-website-concept-v1.jpg",
        "title": "Landing page design for scandinavian company",
        "content": "<div class='project-subtitle'>About the company:</div><p>Eqology is a network marketing company established in Norway in 1998. The name Eqology is a compound of EQ and Eqcology and the story it tells is both about the products, which are all based on natural ingredients, and on the unique forces nature can offer.</p><div class='project-subtitle'>My role:</div><p>UI design</p><p>Landing page design for a scandinavian company which main business is selling natural cosmetics all over Europe.</p><p>The aim of the project was to simplify the design and to emphasize on the products and increase overall sales. Since the company branding was already created I used their style guide (colors, typefaces, buttons, etc.) in order to create the final artwork.</p><p>We are working with a scandinavian company which main business is selling natural cosmetic products to help them update their website. As part of the exploration process, we went through a couple of styles and this is one of them.</p><img class='img-fluid' src='/assets/images/myWork/web-design/eqology-screenshot.png' alt='Landing page design for scandinavian company' />",
        "content2": "<p>The idea with the water splatters and the ice came from the main assumption for clearliness and nature. I wanted to give the users the sence of pure product, freshness and cold that can make them feel attracted by the company and it’s phylosophy.</p>",
        "filterId": "webdesign"
    },
    {
        "id": "dashboard-design",
        "thumb": "/assets/images/myWork/web-design/dashboard-design-thumb.jpg",
        "url": "/assets/images/myWork/web-design/dashboard-design.jpg",
        "title": "Dashboard design",
        "content": "<div class='project-subtitle'>About the company:</div><p>PSP is software solution business, producing software that makes difference. The company has over a decade of experience in design, production and delivery of software solutions for small businesses and large corporate companies.</p><div class='project-subtitle'>My role:</div><p>UI design</p><p>This project presents the dashboard overview of a business platform for multi-level marketing companies that offer a set of business tools to their first level users so they can run their businesses easier.</p><div class='project-subtitle'>Main goal:</div><p>Present the data from all the apps in the platform in one place, simple and readable for the users.</p><p>The platform is available exclusivery for subscribed busines members who sales the company's products and the aim of this projest is to help their marketing by giving the necessary insights about the tools they use.</p><div class='project-subtitle'>What was my approach:</div><p>Once I understand the target audience and their motivation to use the platform and the tools it contains, I have decided to emphasize on the Activities because these are the main incentives that could bring the users back to the dashboard. Also they required an action (it may be an upcoming event or a reminder to call a customer).</p><img class='img-fluid' src='/assets/images/myWork/web-design/dashboard-screenshot.png' alt='Dashboard design' />",
        "content2": "<div class='d-flex flex-wrap flex-sm-nowrap align-items-center py-3 py-lg-5'><img class='img-fluid w-40 mb-3 mb-lg-0 mr-md-3 mr-xl-5' src='/assets/images/myWork/web-design/dashboard-screenshot2.png' alt='Dashboard design' /><div><p>Each activity event has a very short description, a related place or a person and an action button. Also each activity can be clicked and opened for receiving additional information. In the right side on mobile and at the bottom of desktop devices there is a light name of the app the activity came from. I've tried to make the dashboard as simple as possible and in the same time to contain all the necessary information for the user so they won't need to visit each application and search for what's new for them in there.</p><p>The navigation on mobile is relocated on the right side so it can be reached easier if the user is on the move.</p><p>The colors are bright and subtle in order not to overwhelm the users and to make them paying attention to the content.</p></div></div>",
        "filterId": "webdesign"
    },
    {
        "id": "calendar-app-design",
        "thumb": "/assets/images/myWork/web-design/WhatsOn-app-thumb.jpg",
        "url": "/assets/images/myWork/web-design/WhatsOn-app-design.jpg",
        "title": "Calendar app design",
        "content": "<div class='project-subtitle'>About the company:</div><p>Eqology is a network marketing company established in Norway in 1998. The name Eqology is a compound of EQ and Eqcology and the story it tells is both about the products, which are all based on natural ingredients, and on the unique forces nature can offer.</p><div class='project-subtitle'>My role:</div><p>UI design</p><div class='project-subtitle'>Main goal:</div><p>Create a simple, yet functional and intuitive calendar application that shows the incoming events in user's areas. By knowing where are the next company events taking places, the users can easily invite potential clients and promote the company products and it's benefits.</p><p>The app was created as an additional feature for a business marketing platform that contains plenty of tools for selfpromotion and sales. The client already had a big network with business people that the company wanted to keep informed about future events in their areas.</p><p>The app has quite a simple look with three viewing options (daily, weekly and monthly) and an area filter. Since it’s a calendar app and the users are used to see calendars on their smartphones, this app should look quite similar without the need ot learn something specific.</p><img class='img-fluid' src='/assets/images/myWork/web-design/calendar-screenshots.png' alt='Calendar app design' />",
        "content2": "",
        "filterId": "webdesign"
    },
    {
        "id": "personal-website-builder-design",
        "thumb": "/assets/images/myWork/web-design/pws-design-thumb.jpg",
        "url": "/assets/images/myWork/web-design/personal-website-design-frontend.jpg",
        "title": "Personal website generator design",
        "content": "<div class='project-subtitle'>About the company:</div><p>Forever Living is a multi-billion dollar company, operating in over 160 contries, affiliated with the world's largest grower, manufacturer and distributor of Aloe Vera.</p><div class='project-subtitle'>My role:</div><p>UI & UX design</p><div class='project-subtitle'>Main goal:</div><p>Create a personalised website with ability to change and create your own content under the hood of Forever Living.</p><p>The platform is available exclusively for subscribed business members who sales the company’s products and the aim of this project is to increase their ability to present themselves and their business to potential customers.</p><p>The app contains two views: backend view, where the users can select the sections of their website as well as the information for each section, and the frontend view which is the public website.</p><img class='img-fluid' src='/assets/images/myWork/web-design/pws-screenshots.png' alt='Personal website generator design' />",
        "content2": "<p class='pt-3 pt-lg-5'>The website editor gives the user the option to turn on/off different website sections and to choose between preselected options for future events or specific product slogans.</p><p>One of the main issues that I’ve faced was that there are lots of places where the user supposed to write it’s own content but the company wanted to have control over it since their name is behind the project so I’ve suggested to create a dropdowns with different options so the users will still have the ability to choose and give them a feel of ownership and at the same time their content will be controlled by the company.</p><p>The colors of the project follows the company’s style guide.</p>",
        "filterId": "webdesign"
    },
    {
        "id": "go-tenant-dashboard-design",
        "thumb": "/assets/images/myWork/web-design/dashboard-thumb.jpg",
        "url": "/assets/images/myWork/web-design/GoTenant-project.jpg",
        "title": "Website dashboard design",
        "content": "<div class='project-subtitle'>About the project:</div><p>Go Tenant! is a property management software will helps a landlords in United Kingdom to stay compliant in the whole process of renting their homes to potential tenants.</p><div class='project-subtitle'>My role:</div><p>UI design</p><div class='project-subtitle'>Main goal:</div><p>Present the useful data from all different tools of the platform in one place, simple and readable for the users.</p>",
        "content2": "",
        "filterId": "webdesign"
    },
    {
        "id": "forever-subscription-design",
        "thumb": "/assets/images/myWork/web-design/subscription-design-thumb.jpg",
        "url": "/assets/images/myWork/web-design/subscription-mockup-v2.jpg",
        "title": "Subscription page design",
        "content": "<div class='project-subtitle'>About the company:</div><p>Forever Living is a multi-billion dollar company, operating in over 160 contries, affiliated with the world's largest grower, manufacturer and distributor of Aloe Vera.</p><div class='project-subtitle'>My role:</div><p>UI design</p><p>Design concept for a big american cosmetic company. The aim of the design was to make the subscription page more appealing for the users with an emphasize on the features and the additional benefits of subscribing for the platform.</p>",
        "content2": "",
        "filterId": "webdesign"
    }
]
